In [21]:
import pandas as pd

In [22]:
df = pd.read_csv("../data/members.csv")

In [23]:
df

,ID,First Name,Last Name,Email,Phone,Customer Type,Member Type
0,100,Carol,Shaw,cshaw0@mlb.com,(206)804-8771,Individual,1
1,101,Elizabeth,Carr,ecarr1@oracle.com,(512)187-2507,Individual,1
2,102,Ernest,Ramos,eramos2@plala.or.jp,(816)540-4257,Individual,1
3,103,Jane,Carter,jcarter3@harvard.edu,(214)839-0542,Individual,1
4,104,Martha,Cooper,mcooper4@go.com,(727)235-5696,Individual,1
...,...,...,...,...,...,...,...
295,395,Diana,Hicks,dhicks87@bloglovin.com,(513)289-6421,Individual,1
296,396,Thomas,Griffin,tgriffin88@smugmug.com,(801)631-7393,Business,1
297,397,Jonathan,Turner,jturner89@fc2.com,(310)968-4752,Individual,1
298,398,Jeremy,Robinson,jrobinson8a@gnu.org,(616)146-1693,Individual,1
299,399,David,Robertson,drobertson8b@istockphoto.com,(404)982-4393,Individual,1

In [24]:
df["First Name"]

0          Carol
1      Elizabeth
2         Ernest
3           Jane
4         Martha
         ...
295        Diana
296       Thomas
297     Jonathan
298       Jeremy
299        David
Name: First Name, Length: 300, dtype: object

In [25]:
type(df["First Name"])

pandas.core.series.Series

In [26]:
ser = df["First Name"]

In [27]:
type(ser)

pandas.core.series.Series

In [28]:
df[["First Name", "Last Name"]]

    First Name  Last Name
0        Carol       Shaw
1    Elizabeth       Carr
2       Ernest      Ramos
3         Jane     Carter
4       Martha     Cooper
..         ...        ...
295      Diana      Hicks
296     Thomas    Griffin
297   Jonathan     Turner
298     Jeremy   Robinson
299      David  Robertson

[300 rows x 2 columns]

In [29]:
type(df[["First Name", "Last Name"]])

pandas.core.frame.DataFrame

In [30]:
ser = df.iloc[0,:]

In [31]:
ser

ID                          100
First Name                Carol
Last Name                  Shaw
Email            cshaw0@mlb.com
Phone             (206)804-8771
Customer Type        Individual
Member Type                   1
Name: 0, dtype: object

In [32]:
type(ser)

pandas.core.series.Series

In [33]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [34]:
import numpy as np

In [35]:
pd.Series(np.arange(100))

0      0
1      1
2      2
3      3
4      4
      ..
95    95
96    96
97    97
98    98
99    99
Length: 100, dtype: int32

In [36]:
type(pd.Series(np.arange(100)))

pandas.core.series.Series

In [37]:
df = pd.DataFrame(pd.Series(np.arange(100)))

In [38]:
df

     0
0    0
1    1
2    2
3    3
4    4
..  ..
95  95
96  96
97  97
98  98
99  99

[100 rows x 1 columns]